MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J72/mcu.h
extern volatile WDTCONbits_t WDTCONbits __at(0xFD1);
// bitfield macros
#define _WDTCON_SWDTEN_POSN                                 0x0
#define _WDTCON_SWDTEN_POSITION                             0x0
#define _WDTCON_SWDTEN_SIZE                                 0x1
#define _WDTCON_SWDTEN_LENGTH                               0x1
#define _WDTCON_SWDTEN_MASK                                 0x1
#define _WDTCON_REGSLP_POSN                                 0x7
#define _WDTCON_REGSLP_POSITION                             0x7
#define _WDTCON_REGSLP_SIZE                                 0x1
#define _WDTCON_REGSLP_LENGTH                               0x1
#define _WDTCON_REGSLP_MASK                                 0x80
#define _WDTCON_SWDTE_POSN                                  0x0
#define _WDTCON_SWDTE_POSITION                              0x0
#define _WDTCON_SWDTE_SIZE                                  0x1
#define _WDTCON_SWDTE_LENGTH                                0x1
#define _WDTCON_SWDTE_MASK                                  0x1

// Register: LCDREG
#define LCDREG LCDREG
extern volatile unsigned char           LCDREG              __at(0xFD2);
#ifndef _LIB_BUILD
asm("LCDREG equ 0FD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKSEL                  :2;
        unsigned MODE13                 :1;
        unsigned BIAS                   :3;
        unsigned CPEN                   :1;
    };
    struct {
        unsigned CKSEL0                 :1;
        unsigned CKSEL1                 :1;
        unsigned                        :1;
        unsigned BIAS0                  :1;
        unsigned BIAS1                  :1;
        unsigned BIAS2                  :1;
    };
} LCDREGbits_t;
extern volatile LCDREGbits_t LCDREGbits __at(0xFD2);
// bitfield macros
#define _LCDREG_CKSEL_POSN                                  0x0
#define _LCDREG_CKSEL_POSITION                              0x0
#define _LCDREG_CKSEL_SIZE                                  0x2
#define _LCDREG_CKSEL_LENGTH                                0x2
#define _LCDREG_CKSEL_MASK                                  0x3
#define _LCDREG_MODE13_POSN                                 0x2
#define _LCDREG_MODE13_POSITION                             0x2
#define _LCDREG_MODE13_SIZE                                 0x1
#define _LCDREG_MODE13_LENGTH                               0x1
#define _LCDREG_MODE13_MASK                                 0x4
#define _LCDREG_BIAS_POSN                                   0x3
#define _LCDREG_BIAS_POSITION                               0x3
#define _LCDREG_BIAS_SIZE                                   0x3
#define _LCDREG_BIAS_LENGTH                                 0x3
#define _LCDREG_BIAS_MASK                                   0x38
#define _LCDREG_CPEN_POSN                                   0x6
#define _LCDREG_CPEN_POSITION                               0x6
#define _LCDREG_CPEN_SIZE                                   0x1
#define _LCDREG_CPEN_LENGTH                                 0x1
#define _LCDREG_CPEN_MASK                                   0x40
#define _LCDREG_CKSEL0_POSN                                 0x0
#define _LCDREG_CKSEL0_POSITION                             0x0
#define _LCDREG_CKSEL0_SIZE                                 0x1
#define _LCDREG_CKSEL0_LENGTH                               0x1
#define _LCDREG_CKSEL0_MASK                                 0x1
#define _LCDREG_CKSEL1_POSN                                 0x1
#define _LCDREG_CKSEL1_POSITION                             0x1
#define _LCDREG_CKSEL1_SIZE                                 0x1
#define _LCDREG_CKSEL1_LENGTH                               0x1
#define _LCDREG_CKSEL1_MASK                                 0x2
#define _LCDREG_BIAS0_POSN                                  0x3
#define _LCDREG_BIAS0_POSITION                              0x3
#define _LCDREG_BIAS0_SIZE                                  0x1
#define _LCDREG_BIAS0_LENGTH                                0x1
#define _LCDREG_BIAS0_MASK                                  0x8
#define _LCDREG_BIAS1_POSN                                  0x4
#define _LCDREG_BIAS1_POSITION                              0x4
#define _LCDREG_BIAS1_SIZE                                  0x1
#define _LCDREG_BIAS1_LENGTH                                0x1
#define _LCDREG_BIAS1_MASK                                  0x10
#define _LCDREG_BIAS2_POSN                                  0x5
#define _LCDREG_BIAS2_POSITION                              0x5
#define _LCDREG_BIAS2_SIZE                                  0x1
#define _LCDREG_BIAS2_LENGTH                                0x1
#define _LCDREG_BIAS2_MASK                                  0x20

// Register: OSCCON
#define OSCCON OSCCON
extern volatile unsigned char           OSCCON              __at(0xFD3);
#ifndef _LIB_BUILD
asm("OSCCON equ 0FD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCS                    :2;
        unsigned IOFS                   :1;
        unsigned OSTS                   :1;
        unsigned IRCF                   :3;
        unsigned IDLEN                  :1;
    };
    struct {
        unsigned SCS0                   :1;
        unsigned SCS1                   :1;
        unsigned                        :2;
        unsigned IRCF0                  :1;
        unsigned IRCF1                  :1;
        unsigned IRCF2                  :1;
    };
} OSCCONbits_t;
extern volatile OSCCONbits_t OSCCONbits __at(0xFD3);
// bitfield macros
#define _OSCCON_SCS_POSN                                    0x0
#define _OSCCON_SCS_POSITION                                0x0
#define _OSCCON_SCS_SIZE                                    0x2
#define _OSCCON_SCS_LENGTH                                  0x2
#define _OSCCON_SCS_MASK                                    0x3
#define _OSCCON_IOFS_POSN                                   0x2
#define _OSCCON_IOFS_POSITION                               0x2
#define _OSCCON_IOFS_SIZE                                   0x1
#define _OSCCON_IOFS_LENGTH                                 0x1
#define _OSCCON_IOFS_MASK                                   0x4
#define _OSCCON_OSTS_POSN                                   0x3
#define _OSCCON_OSTS_POSITION                               0x3
#define _OSCCON_OSTS_SIZE                                   0x1
#define _OSCCON_OSTS_LENGTH                                 0x1
#define _OSCCON_OSTS_MASK                                   0x8
#define _OSCCON_IRCF_POSN                                   0x4
#define _OSCCON_IRCF_POSITION                               0x4
#define _OSCCON_IRCF_SIZE                                   0x3
#define _OSCCON_IRCF_LENGTH                                 0x3
#define _OSCCON_IRCF_MASK                                   0x70
#define _OSCCON_IDLEN_POSN                                  0x7
#define _OSCCON_IDLEN_POSITION                              0x7
#define _OSCCON_IDLEN_SIZE                                  0x1
#define _OSCCON_IDLEN_LENGTH                                0x1
#define _OSCCON_IDLEN_MASK                                  0x80
#define _OSCCON_SCS0_POSN                                   0x0
#define _OSCCON_SCS0_POSITION                               0x0
#define _OSCCON_SCS0_SIZE                                   0x1
#define _OSCCON_SCS0_LENGTH                                 0x1
#define _OSCCON_SCS0_MASK                                   0x1
#define _OSCCON_SCS1_POSN                                   0x1
#define _OSCCON_SCS1_POSITION                               0x1
#define _OSCCON_SCS1_SIZE                                   0x1
#define _OSCCON_SCS1_LENGTH                                 0x1
#define _OSCCON_SCS1_MASK                                   0x2
#define _OSCCON_IRCF0_POSN                                  0x4
#define _OSCCON_IRCF0_POSITION                              0x4
#define _OSCCON_IRCF0_SIZE                                  0x1
#define _OSCCON_IRCF0_LENGTH                                0x1
#define _OSCCON_IRCF0_MASK                                  0x10
#define _OSCCON_IRCF1_POSN                                  0x5
#define _OSCCON_IRCF1_POSITION                              0x5
#define _OSCCON_IRCF1_SIZE                                  0x1
#define _OSCCON_IRCF1_LENGTH                                0x1
#define _OSCCON_IRCF1_MASK                                  0x20
#define _OSCCON_IRCF2_POSN                                  0x6
#define _OSCCON_IRCF2_POSITION                              0x6
#define _OSCCON_IRCF2_SIZE                                  0x1
#define _OSCCON_IRCF2_LENGTH                                0x1
#define _OSCCON_IRCF2_MASK                                  0x40

// Register: T0CON
#define T0CON T0CON
extern volatile unsigned char           T0CON               __at(0xFD5);
#ifndef _LIB_BUILD
asm("T0CON equ 0FD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T0PS                   :3;
        unsigned PSA                    :1;
        unsigned T0SE                   :1;
        unsigned T0CS                   :1;
        unsigned T08BIT                 :1;
        unsigned TMR0ON                 :1;
    };
    struct {
        unsigned T0PS0                  :1;
        unsigned T0PS1                  :1;
        unsigned T0PS2                  :1;
    };
} T0CONbits_t;
extern volatile T0CONbits_t T0CONbits __at(0xFD5);
// bitfield macros
#define _T0CON_T0PS_POSN                                    0x0
#define _T0CON_T0PS_POSITION                                0x0
#define _T0CON_T0PS_SIZE                                    0x3
#define _T0CON_T0PS_LENGTH                                  0x3
#define _T0CON_T0PS_MASK                                    0x7
#define _T0CON_PSA_POSN                                     0x3
#define _T0CON_PSA_POSITION                                 0x3
#define _T0CON_PSA_SIZE                                     0x1
#define _T0CON_PSA_LENGTH                                   0x1
#define _T0CON_PSA_MASK                                     0x8
#define _T0CON_T0SE_POSN                                    0x4
#define _T0CON_T0SE_POSITION                                0x4
#define _T0CON_T0SE_SIZE                                    0x1
#define _T0CON_T0SE_LENGTH                                  0x1
#define _T0CON_T0SE_MASK                                    0x10
#define _T0CON_T0CS_POSN                                    0x5
#define _T0CON_T0CS_POSITION                                0x5
#define _T0CON_T0CS_SIZE                                    0x1
#define _T0CON_T0CS_LENGTH                                  0x1
#define _T0CON_T0CS_MASK                                    0x20
#define _T0CON_T08BIT_POSN                                  0x6
#define _T0CON_T08BIT_POSITION                              0x6
#define _T0CON_T08BIT_SIZE                                  0x1
#define _T0CON_T08BIT_LENGTH                                0x1
#define _T0CON_T08BIT_MASK                                  0x40
#define _T0CON_TMR0ON_POSN                                  0x7
#define _T0CON_TMR0ON_POSITION                              0x7
#define _T0CON_TMR0ON_SIZE                                  0x1
#define _T0CON_TMR0ON_LENGTH                                0x1
#define _T0CON_TMR0ON_MASK                                  0x80
#define _T0CON_T0PS0_POSN                                   0x0
#define _T0CON_T0PS0_POSITION                               0x0
#define _T0CON_T0PS0_SIZE                                   0x1
#define _T0CON_T0PS0_LENGTH                                 0x1
#define _T0CON_T0PS0_MASK                                   0x1
#define _T0CON_T0PS1_POSN                                   0x1
#define _T0CON_T0PS1_POSITION                               0x1
#define _T0CON_T0PS1_SIZE                                   0x1
#define _T0CON_T0PS1_LENGTH                                 0x1
#define _T0CON_T0PS1_MASK                                   0x2
#define _T0CON_T0PS2_POSN                                   0x2
#define _T0CON_T0PS2_POSITION                               0x2
#define _T0CON_T0PS2_SIZE                                   0x1
#define _T0CON_T0PS2_LENGTH                                 0x1
#define _T0CON_T0PS2_MASK                                   0x4

